[
  {
    "subject": "informatics",
    "topic": "HTML",
    "text": "HTML (HyperText Markup Language) — язык разметки, используемый для создания структуры веб-страниц."
  },
  {
    "subject": "informatics",
    "topic": "CSS",
    "text": "CSS (Cascading Style Sheets) — каскадные таблицы стилей, используемые для оформления внешнего вида HTML-страниц."
  },
  {
    "subject": "informatics",
    "topic": "JavaScript",
    "text": "JavaScript — язык программирования, применяемый для добавления интерактивности на веб-страницы."
  },
  {
    "subject": "informatics",
    "topic": "HTTP",
    "text": "HTTP (HyperText Transfer Protocol) — протокол передачи данных, используемый для общения между браузером и сервером."
  },
  {
    "subject": "informatics",
    "topic": "Переменная",
    "text": "Переменная — это именованная область памяти, используемая для хранения данных во время выполнения программы."
  },
  {
    "subject": "informatics",
    "topic": "Функция",
    "text": "Функция — это блок кода, который можно многократно вызывать для выполнения определённых действий."
  },
  {
    "subject": "informatics",
    "topic": "Циклы",
    "text": "Циклы позволяют выполнять один и тот же блок кода многократно, пока выполняется определённое условие."
  },
  {
    "subject": "informatics",
    "topic": "Условный оператор",
    "text": "Условный оператор позволяет выполнять различные блоки кода в зависимости от истинности условия."
  },
  {
    "subject": "informatics",
    "topic": "Массив",
    "text": "Массив — структура данных, позволяющая хранить несколько значений в одной переменной."
  },
  {
    "subject": "informatics",
    "topic": "ООП",
    "text": "Объектно-ориентированное программирование (ООП) — парадигма программирования, основанная на концепциях объектов и классов."
  },
  {
    "subject": "informatics",
    "topic": "JSON",
    "text": "JSON (JavaScript Object Notation) — формат обмена данными, удобный для хранения и передачи структурированной информации."
  },
  {
    "subject": "informatics",
    "topic": "IP-адрес",
    "text": "IP-адрес — уникальный идентификатор устройства в компьютерной сети."
  },
  {
    "subject": "informatics",
    "topic": "DNS",
    "text": "DNS (Domain Name System) — система, преобразующая доменные имена в IP-адреса."
  },
  {
    "subject": "informatics",
    "topic": "Протоколы передачи данных",
    "text": "Протоколы передачи данных (TCP/IP, FTP, SMTP и др.) определяют правила обмена информацией между компьютерами."
  },
  {
    "subject": "informatics",
    "topic": "Базы данных",
    "text": "База данных — организованная структура для хранения, изменения и поиска информации."
  },
  {
    "subject": "informatics",
    "topic": "SQL",
    "text": "SQL (Structured Query Language) — язык для управления и запросов к базам данных."
  },
  {
    "subject": "informatics",
    "topic": "Булева алгебра",
    "text": "Булева алгебра — раздел алгебры, в котором переменные принимают значения ИСТИНА (1) или ЛОЖЬ (0)."
  },
  {
    "subject": "informatics",
    "topic": "Логические операции",
    "text": "Основные логические операции: И (AND), ИЛИ (OR), НЕ (NOT), ИСКЛЮЧАЮЩЕЕ ИЛИ (XOR)."
  },
  {
    "subject": "informatics",
    "topic": "Сжатие данных",
    "text": "Сжатие данных — процесс уменьшения объёма информации для экономии места или ускорения передачи."
  },
  {
    "subject": "informatics",
    "topic": "Кодирование информации",
    "text": "Кодирование — представление информации в виде последовательности символов или сигналов."
  },
  {
    "subject": "informatics",
    "topic": "Алгоритм",
    "text": "Алгоритм — последовательность шагов для решения поставленной задачи."
  },
  {
    "subject": "informatics",
    "topic": "Диаграмма потоков данных",
    "text": "Диаграммы потоков данных отображают движение данных между процессами и хранилищами."
  },
  {
    "subject": "informatics",
    "topic": "Форматы файлов",
    "text": "Форматы файлов (txt, jpg, mp3, exe и др.) определяют тип содержимого и правила его хранения."
  }
]